codebydant/nrF52-cmake-examples/examples/ble_lightbulb/src/main.c
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "app_error.h"
#include "app_timer.h"
#include "ble.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_bas.h"
#include "ble_conn_params.h"
#include "ble_conn_state.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "bsp_btn_ble.h"
#include "fds.h"
#include "nordic_common.h"
#include "nrf.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "nrf_pwr_mgmt.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"
#include "peer_manager.h"
#include "peer_manager_handler.h"
#include "sensorsim.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#include "services/post_data.h"

#define DEVICE_NAME                                                                                \
  "BLE_Lightbulb" /**< Name of device. Will be included in the advertising                         \
                     data. */
#define MANUFACTURER_NAME                                                                          \
  "NordicSemiconductor" /**< Manufacturer. Will be passed to Device                                \
                           Information Service. */
#define APP_ADV_INTERVAL                                                                           \
  300 /**< The advertising interval (in units of 0.625 ms. This value                              \
         corresponds to 187.5 ms). */

#define APP_ADV_DURATION                                                                           \
  18000 /**< The advertising duration (180 seconds) in units of 10                                 \
           milliseconds. */
#define APP_BLE_OBSERVER_PRIO                                                                      \
  3 /**< Application's BLE observer priority. You shouldn't need to modify                         \
       this value. */
#define APP_BLE_CONN_CFG_TAG 1 /**< A tag identifying the SoftDevice BLE configuration. */

#define MIN_CONN_INTERVAL                                                                          \
  MSEC_TO_UNITS(100, UNIT_1_25_MS) /**< Minimum acceptable connection interval (0.1                \
                                      seconds). */
#define MAX_CONN_INTERVAL                                                                          \
  MSEC_TO_UNITS(200, UNIT_1_25_MS) /**< Maximum acceptable connection interval (0.2                \
                                      second). */
#define SLAVE_LATENCY 0            /**< Slave latency. */
#define CONN_SUP_TIMEOUT                                                                           \
  MSEC_TO_UNITS(4000, UNIT_10_MS) /**< Connection supervisory timeout (4 seconds). */

#define FIRST_CONN_PARAMS_UPDATE_DELAY                                                             \
  APP_TIMER_TICKS(5000) /**< Time from initiating event (connect or start of                       \
                           notification) to first time                                             \
                           sd_ble_gap_conn_param_update is called (5 seconds).                     \
                           */
#define NEXT_CONN_PARAMS_UPDATE_DELAY                                                              \
  APP_TIMER_TICKS(30000) /**< Time between each call to                                            \
                            sd_ble_gap_conn_param_update after the first call                      \
                            (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT                                                               \
  3 /**< Number of attempts before giving up the connection parameter                              \
       negotiation. */

#define SEC_PARAM_BOND 1     /**< Perform bonding. */
#define SEC_PARAM_MITM 0     /**< Man In The Middle protection not required. */
#define SEC_PARAM_LESC 0     /**< LE Secure Connections not enabled. */
#define SEC_PARAM_KEYPRESS 0 /**< Keypress notifications not enabled. */
#define SEC_PARAM_IO_CAPABILITIES BLE_GAP_IO_CAPS_NONE /**< No I/O capabilities. */
#define SEC_PARAM_OOB 0                                /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE 7                       /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE 16                      /**< Maximum encryption key size. */

#define DEAD_BEEF                                                                                  \
  0xDEADBEEF /**< Value used as error code on stack dump, can be used to                           \
                identify stack location on stack unwind. */

// Corresponds to LED2 on the development kit
#define LIGHTBULB_LED                                                                              \
  BSP_BOARD_LED_1 /**< LED to be toggled with the help of the LED Button                           \
                     Service. */

NRF_BLE_GATT_DEF(m_gatt);           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);             /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising); /**< Advertising module instance. */
BLE_LED_SERVICE_DEF(m_led_service);

static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID; /**< Handle of the current connection. */

/* YOUR_JOB: Declare all services structure your application is using
 *  BLE_XYZ_DEF(m_xyz);
 */

// YOUR_JOB: Use UUIDs for service(s) used in your application.
static ble_uuid_t m_adv_uuids[] = /**< Universally unique service identifiers. */
    {{BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}};

// static void advertising_start(bool erase_bonds);
static void advertising_start();

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product.
 * You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name) {
  app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

