codebydant/nrF52-cmake-examples/examples/ble_lightbulb/src/main.c
/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
// static void pm_evt_handler(pm_evt_t const *p_evt) {
//   pm_handler_on_pm_evt(p_evt);
//   pm_handler_flash_clean(p_evt);

//   switch (p_evt->evt_id) {
//   case PM_EVT_PEERS_DELETE_SUCCEEDED:
//     advertising_start(false);
//     break;

//   default:
//     break;
//   }
// }

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application
 * timers.
 */
static void timers_init(void) {
  // Initialize timer module.
  ret_code_t err_code = app_timer_init();
  APP_ERROR_CHECK(err_code);

  // Create timers.

  /* YOUR_JOB: Create any timers to be used by the application.
               Below is an example of how to create a timer.
               For every new timer needed, increase the value of the macro
     APP_TIMER_MAX_TIMERS by
               one.
     ret_code_t err_code;
     err_code = app_timer_create(&m_app_timer_id, APP_TIMER_MODE_REPEATED,
     timer_timeout_handler);
     APP_ERROR_CHECK(err_code); */
}

/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile)
 * parameters of the
 *          device including the device name, appearance, and the preferred
 * connection parameters.
 */
static void gap_params_init(void) {
  ret_code_t err_code;
  ble_gap_conn_params_t gap_conn_params;
  ble_gap_conn_sec_mode_t sec_mode;

  BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

  err_code =
      sd_ble_gap_device_name_set(&sec_mode, (const uint8_t *)DEVICE_NAME, strlen(DEVICE_NAME));
  APP_ERROR_CHECK(err_code);

  /* YOUR_JOB: Use an appearance value matching the application's use case.
     err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_);
     APP_ERROR_CHECK(err_code); */

  memset(&gap_conn_params, 0, sizeof(gap_conn_params));

  gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
  gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
  gap_conn_params.slave_latency = SLAVE_LATENCY;
  gap_conn_params.conn_sup_timeout = CONN_SUP_TIMEOUT;

  err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void) {
  ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may
 * need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went
 * wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error) { APP_ERROR_HANDLER(nrf_error); }

/**@brief Function for handling the YYY Service events.
 * YOUR_JOB implement a service handler function depending on the event the
service you are using can generate
 *
 * @details This function will be called for all YY Service events which are
passed to
 *          the application.
 *
 * @param[in]   p_yy_service   YY Service structure.
 * @param[in]   p_evt          Event received from the YY Service.
 *
 *
static void on_yys_evt(ble_yy_service_t     * p_yy_service,
                       ble_yy_service_evt_t * p_evt)
{
    switch (p_evt->evt_type)
    {
        case BLE_YY_NAME_EVT_WRITE:
            APPL_LOG("[APPL]: charact written with value %s. ",
p_evt->params.char_xx.value.p_str);
            break;

        default:
            // No implementation needed.
            break;
    }
}
*/

/**@brief Function for initializing services that will be used by the
 * application.
 */
// static void services_init(void) {
//   ret_code_t err_code;
//   nrf_ble_qwr_init_t qwr_init = {0};

//   // Initialize Queued Write Module.
//   qwr_init.error_handler = nrf_qwr_error_handler;

//   err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
//   APP_ERROR_CHECK(err_code);

//    YOUR_JOB: Add code to initialize the services used by the application.
//      ble_xxs_init_t                     xxs_init;
//      ble_yys_init_t                     yys_init;

//      // Initialize XXX Service.
//      memset(&xxs_init, 0, sizeof(xxs_init));

//      xxs_init.evt_handler                = NULL;
//      xxs_init.is_xxx_notify_supported    = true;
//      xxs_init.ble_xx_initial_value.level = 100;

//      err_code = ble_bas_init(&m_xxs, &xxs_init);
//      APP_ERROR_CHECK(err_code);

//      // Initialize YYY Service.
//      memset(&yys_init, 0, sizeof(yys_init));
//      yys_init.evt_handler                  = on_yys_evt;
//      yys_init.ble_yy_initial_value.counter = 0;

//      err_code = ble_yy_service_init(&yys_init, &yy_init);
//      APP_ERROR_CHECK(err_code);

// }

/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection
 * Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been
 * done by simply
 *                setting the disconnect_on_fail config parameter, but instead
 * we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t *p_evt) {
  ret_code_t err_code;

  if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED) {
    err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
    APP_ERROR_CHECK(err_code);
  }
}

/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went
 * wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error) { APP_ERROR_HANDLER(nrf_error); }

/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void) {
  ret_code_t err_code;
  ble_conn_params_init_t cp_init;

  memset(&cp_init, 0, sizeof(cp_init));

  cp_init.p_conn_params = NULL;
  cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
  cp_init.next_conn_params_update_delay = NEXT_CONN_PARAMS_UPDATE_DELAY;
  cp_init.max_conn_params_update_count = MAX_CONN_PARAMS_UPDATE_COUNT;
  cp_init.start_on_notify_cccd_handle = BLE_GATT_HANDLE_INVALID;
  cp_init.disconnect_on_fail = false;
  cp_init.evt_handler = on_conn_params_evt;
  cp_init.error_handler = conn_params_error_handler;

