codebydant/nrF52-cmake-examples/examples/ble_lightbulb/src/main.c
  memset(&init, 0, sizeof(init));

  init.advdata.name_type = BLE_ADVDATA_FULL_NAME;
  init.advdata.include_appearance = true;
  init.advdata.flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
  init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
  init.advdata.uuids_complete.p_uuids = m_adv_uuids;

  init.config.ble_adv_fast_enabled = true;
  init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
  init.config.ble_adv_fast_timeout = APP_ADV_DURATION;

  init.evt_handler = on_adv_evt;

  err_code = ble_advertising_init(&m_advertising, &init);
  APP_ERROR_CHECK(err_code);

  ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}

/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was
 * pressed to wake the application up.
 */
// static void buttons_leds_init(bool *p_erase_bonds) {
//   ret_code_t err_code;
//   bsp_event_t startup_event;

//   err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
//   APP_ERROR_CHECK(err_code);

//   err_code = bsp_btn_ble_init(NULL, &startup_event);
//   APP_ERROR_CHECK(err_code);

//   *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
// }
/*
 * @details Initializes all LEDs used by the application.
 */
static void leds_init() {
  ret_code_t err_code;

  err_code = bsp_init(BSP_INIT_LEDS, bsp_event_handler);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the nrf log module.
 */
// static void log_init(void) {
//   ret_code_t err_code = NRF_LOG_INIT(NULL);
//   APP_ERROR_CHECK(err_code);

//   NRF_LOG_DEFAULT_BACKENDS_INIT();
// }

/**@brief Function for initializing power management.
 */
static void power_management_init(void) {
  ret_code_t err_code;
  err_code = nrf_pwr_mgmt_init();
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next
 * event occurs.
 */
static void idle_state_handle(void) {
  if (NRF_LOG_PROCESS() == false) {
    nrf_pwr_mgmt_run();
  }
}

/**@brief Function for starting advertising.
 */
// static void advertising_start(bool erase_bonds) {
//   if (erase_bonds == true) {
//     delete_bonds();
//     // Advertising is started by PM_EVT_PEERS_DELETED_SUCEEDED event
//   } else {
//     ret_code_t err_code =
//         ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);

//     APP_ERROR_CHECK(err_code);
//   }
// }
static void advertising_start() {
  ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling write events to the LED characteristic.
 *
 * @param[in] p_led_service  Instance of LED Service to which the write applies.
 * @param[in] led_state      Written/desired state of the LED.
 */
static void led_write_handler(uint16_t conn_handle, ble_led_service_t *p_led_service,
                              uint8_t led_state) {
  if (led_state) {

    bsp_board_led_off(BSP_BOARD_LED_2);
    NRF_LOG_INFO("Received LED ON!");

  } else {

    bsp_board_led_on(BSP_BOARD_LED_2);
    NRF_LOG_INFO("Received LED OFF!");
  }
}

/**@brief Function for initializing services that will be used by the
 * application.
 */
static void services_init(void) {
  uint32_t err_code;
  // ble_bas_init_t bas_init;
  ble_led_service_init_t led_init;

  nrf_ble_qwr_init_t qwr_init = {0};

  // Initialize Queued Write Module.
  qwr_init.error_handler = nrf_qwr_error_handler;

  err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
  APP_ERROR_CHECK(err_code);

  // 1. Initialize the LED service
  led_init.led_write_handler = led_write_handler;

  err_code = ble_led_service_init(&m_led_service, &led_init);
  APP_ERROR_CHECK(err_code);
  /*
    // 2. Initialize Battery Service.
    memset(&bas_init, 0, sizeof(bas_init));

    // Here the sec level for the Battery Service can be changed/increased.
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(
        &bas_init.battery_level_char_attr_md.cccd_write_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(
        &bas_init.battery_level_char_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(
        &bas_init.battery_level_char_attr_md.write_perm);

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&bas_init.battery_level_report_read_perm);

    bas_init.evt_handler = NULL;
    bas_init.support_notification = true;
    bas_init.p_report_ref = NULL;
    bas_init.initial_batt_level = 100;

    err_code = ble_bas_init(&m_bas, &bas_init);
    APP_ERROR_CHECK(err_code);
    */
}

/**@brief Function for application main entry.
 */
int main(void) {
  // bool erase_bonds;

  NRF_LOG_INIT(NULL);
  NRF_LOG_DEFAULT_BACKENDS_INIT();
  NRF_LOG_PROCESS();
  // NRF_LOG_FLUSH();
  // Initialize.
  // log_init();
  timers_init();
  // NRF_LOG_INFO("BLE Lightbulb example started2.");

  // buttons_leds_init(&erase_bonds);
  leds_init();
  // NRF_LOG_INFO("BLE Lightbulb example started3.");
  power_management_init();
  // NRF_LOG_INFO("BLE Lightbulb example started4.");
  ble_stack_init();
  // NRF_LOG_INFO("BLE Lightbulb example started5.");
  gap_params_init();
  // NRF_LOG_INFO("BLE Lightbulb example started6.");
  gatt_init();
  services_init();
  // NRF_LOG_INFO("BLE Lightbulb example started7.");
  advertising_init();
  // NRF_LOG_INFO("BLE Lightbulb example started8.");
  // services_init();
  // NRF_LOG_INFO("BLE Lightbulb example started9.");
  conn_params_init();
  // NRF_LOG_INFO("BLE Lightbulb example started10.");
  // peer_manager_init();

  // Start execution.
  // NRF_LOG_INFO("Template example started.");
  // NRF_LOG_INFO("BLE Lightbulb example started11.");

  application_timers_start();
  // NRF_LOG_INFO("BLE Lightbulb example started12.");

  // advertising_start(erase_bonds);
  advertising_start();
  NRF_LOG_INFO("BLE Lightbulb example started.");

  // Enter main loop.
  for (;;) {
    // NRF_LOG_INFO("BLE Lightbulb example started - loop.");
    idle_state_handle();
  }

  NRF_LOG_FLUSH();
}

/**
 * @}
 */
